//Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
int a = 11106;
if (a%2 == 0) 
    {
        Console.Write($"Число {a} -> является четным числом");
    }
else
    {
        Console.Write($"Число {a} -> является нечетным числом");
    }