//Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее
int a = 50, b = 27;
if (a > b)
    {
        Console.Write($" Большее {a},  Меньшее  {b}");
    }
    else
    {
        Console.Write($" Большее {b}, Меньшее {a}");
    }